---
kind: other
id: Methods.T:Autodesk.Revit.UI.IExternalApplication
source: html/36d6d130-9b2c-8f83-5225-92a81c01ee0f.htm
---
# IExternalApplication Methods

Implement this method to execute some tasks when Autodesk Revit shuts down.